[
    "Computer Science (CS)\nCS 108 - Applied Computer Concept\n\nDescription: Computer skills course which assumes no prior experience with computers. Introduces computer concepts and word processing; spreadsheets and database software; and examines societal issues. Graduation credit may be earned for CS 108 or CMIS 108; but not for both.\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Info & Comm in Society",
    "CS 111 - Concepts of Computer Science\n\nDescription: Broad view of computer science: hardware; operating systems; software design and development; algorithms; networks; and applications.\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Info & Comm in Society",
    "CS 140 - Introduction to Computing I\n\nDescription: Programming course that assumes basic computer literacy. Introduces a high-level programming language and basic problem solving. IAI Course CS 911.\n\nPrerequisite(s): MATH 120 Minimum Grade of C OR MATH 120E Minimum Grade of C OR MATH 120I Minimum Grade of C OR MATH 120E Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): IM-Computer Science",
    "CS 145 - Introduction to Computing for Engineers\n\nDescription: Introduces C++ programming and basic problem solving. Focuses on computer applications in engineering, science and numeric methods. Prerequisite: Basic computer literacy.\n\nPrerequisite(s): MATH 150 Minimum Grade of C AND\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Summer; Spring; Fall",
    "CS 150 - Introduction to Computing II\n\nDescription: Algorithmic problem solving with a modern programming language. Language syntax; basic design methods; algorithms; and abstraction. IAI Course CS 912.\n\nPrerequisite(s): CS 140 Minimum Grade of C AND\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): IM-Computer Science",
    "CS 198 - Computer Science Work Experience I\n\nDescription: Supervised work experience with agency employing computer scientists or information specialists. For students with part time cooperative jobs. Limited to students enrolled in more than 6 hours.\n\nRestriction(s): May not be enrolled as the following Classifications: Freshman, 1st Semester; Freshman\n\nRegistration Consent: Instructor\n\nCredit Hours: 0\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Cooperative Education Course",
    "CS 199 - CS Cooperative Ed Exp I\n\nDescription: Supervised work experience with agency employing computer scientists or information specialists. First work period of 5-year academic/work experience program.\n\nRestriction(s): May not be enrolled as the following Classifications: Freshman, 1st Semester; Freshman\n\nRegistration Consent: Instructor\n\nCredit Hours: 0\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Cooperative Education Course",
    "CS 234 - Database and Web System Development\n\nDescription: An introduction to multi-tier software systems and database programming and their application to web-based information storage and retrieval systems.\n\nPrerequisite(s): CS 111 Minimum Grade of C AND CS 150 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall",
    "CS 240 - Introduction to Computing III\n\nDescription: Basic software engineering concepts, elementary data structures and algorithms, fundamentals of object-oriented programming.\n\nPrerequisite(s): CS 150 Minimum Grade of C AND\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Summer; Spring; Fall",
    "CS 286 - Introduction to Computer Organization and Architecture\n\nDescription: Processor, memory, I/O structure of computer systems, data representations, instruction set architecture of typical processor as hardware/software interface, processor implementation, performance evaluation methods.\n\nPrerequisite(s): CS 150 Minimum Grade of C AND\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall",
    "CS 298 - Computer Science Work Experience II\n\nDescription: Supervised work experience with agency employing computer scientists or information specialists. For students with part-time cooperative jobs. Limited to students enrolled in more than 6 credit hours.\n\nRestriction(s): Must be enrolled in one of the following Majors: Computer ScienceMust be enrolled in one of the following Classifications: Junior; SophomoreMust be enrolled in one of the following Levels: Undergraduate\n\nRegistration Consent: Instructor\n\nCredit Hours: 0\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Cooperative Education Course",
    "CS 299 - Computer Science Cooperative Education Experience II\n\nDescription: Supervised work experience with agency employing computer scientists or information specialists. Second work period of 5-year academic/work experience program.\n\nRestriction(s): May not be enrolled as the following Classifications: Freshman, 1st Semester; Freshman; Senior with Degree; Senior\n\nRegistration Consent: Instructor\n\nCredit Hours: 0\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Cooperative Education Course",
    "CS 314 - Operating Systems\n\nDescription: Processes, threads, and synchronization; I/O and memory management at the hardware and OS levels; file systems; and implementation of basic OS abstractions, concurrent programming.\n\nPrerequisite(s): CS 286 Minimum Grade of C AND\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall",
    "CS 321 - Human-Computer Interaction Design\n\nDescription: Design of interactions between people and computers. Interface design, conceptual models, design methods, software evaluation and ethical concerns. Software design project.\n\nPrerequisite(s): CS 234 Minimum Grade of C AND (STAT 244 Minimum Grade of C OR STAT 380 Minimum Grade of C)\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall",
    "CS 325 - Software Engineering\n\nDescription: Introduction to the concepts and techniques required to develop complex software systems and manage software projects. Emphasis on object-oriented methodologies and modeling via UML.\n\nPrerequisite(s): CS 150 Minimum Grade of C AND CS 234 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall",
    "CS 330 - Programming Languages\n\nDescription: Design, appropriateness and linguistics issues associated with different programming languages and programming paradigms. Covers syntax and semantics of languages, including BNF Notation.\n\nPrerequisite(s): CS 286 Minimum Grade of C AND\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall",
    "CS 340 - Algorithms and Data Structures\n\nDescription: Considers appropriate choice of data structures, comparisons of algorithms, recursive algorithms, complexity, and introduction to parallel algorithms.\n\nPrerequisite(s): CS 150 Minimum Grade of C AND MATH 224 Minimum Grade of C AND MATH 150 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall",
    "CS 360 - Ethical and Social Implications of Computing\n\nDescription: An introduction to the social, ethical, legal, and professional contexts in which software systems are developed and utilized.\n\nPrerequisite(s): CS 240 Minimum Grade of C AND\n\nRestriction(s): Must be enrolled in one of the following Majors: Computer ScienceMust be enrolled in one of the following Classifications: Junior; Senior with Degree; Senior\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall",
    "CS 382 - Game Design, Development, and Technology\n\nDescription: Introduction to the entire process of game development, including history, social impact, design, programming, software engineering, math, physics, graphics, animation, audio, AI, and hardware.\n\nPrerequisite(s): MATH 152 Minimum Grade of C AND CS 286 Minimum Grade of C AND CS 321 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Occasionally",
    "CS 390 - Topics in Computer Science\n\nDescription: Selected topics in computer science. May be repeated to a maximum of 6 hours for different topics.\n\nRegistration Consent: Instructor\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently",
    "CS 398 - Computer Science Work Experience III\n\nDescription: Supervised work experience with agency employing computer scientists or information specialists. For students with part-time cooperative jobs. Limited to students enrolled in more than 6 credit hours.\n\nRestriction(s): Must be enrolled in one of the following Majors: Computer ScienceMay not be enrolled as the following Classifications: Freshman, 1st Semester; Freshman; Sophomore\n\nRegistration Consent: Instructor\n\nCredit Hours: 0\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Cooperative Education Course",
    "CS 399 - Computer Science Cooperative Education Experience III\n\nDescription: Supervised work experience with agency employing computer scientists or information specialists. Third work period of 5-year academic/work experience program.\n\nRestriction(s): Must be enrolled in one of the following Majors: Computer ScienceMust be enrolled in one of the following Classifications: Junior; Senior with Degree; SeniorMust be enrolled in one of the following Levels: Undergraduate\n\nRegistration Consent: Instructor\n\nCredit Hours: 0\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Cooperative Education Course",
    "CS 423 - Compiler Construction\n\nDescription: Translation of programming languages. Emphasis on techniques used in construction of compilers, including lexical analysis, syntactical analysis, type checking, and code generation.\n\nPrerequisite(s): CS 330 Minimum Grade of C AND\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently",
    "CS 425 - Senior Project: Software Design\n\nDescription: First part of a two-semester sequence in which teams complete the design and planning stages of a software development project. Selected topics in software development, group dynamics, and project management. Not for Graduate credit.\n\nPrerequisite(s): CS 340 Minimum Grade of C AND CS 314 Minimum Grade of C AND CS 325 Minimum Grade of C AND CS 360 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall",
    "CS 434 - Database Management Systems\n\nDescription: Database management system concepts, models, languages. Entity/relationship, relational and object-oriented data models; relational database design and implementation including SQL; and object databases.\n\nPrerequisite(s): CS 150 Minimum Grade of C AND CS 234 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Summer 2024\n\nTerm frequency: Summer",
    "CS 438 - Artificial Intelligence\n\nDescription: Principles and programming techniques of artificial intelligence. Intelligent agents, heuristic programming, knowledge representation, expert systems, and machine learning.\n\nPrerequisite(s): CS 340 Minimum Grade of C AND\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Spring; Fall",
    "CS 447 - Networks and Data Communications\n\nDescription: Concepts of networks and data communications. Networking protocols and architecture; data encoding and transmission; network management; and distributed applications.\n\nPrerequisite(s): CS 340 Minimum Grade of C AND (CS 314 Minimum Grade of C OR CS 414 Minimum Grade of C)\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall",
    "CS 454 - Theory of Computation\n\nDescription: Theoretical foundations of computer science, including a theory of automata: pushdown automata, Turing machines; and formal languages.\n\nPrerequisite(s): CS 330 Minimum Grade of C AND MATH 224 Minimum Grade of C; or Graduate Standing\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Spring; Fall",
    "CS 456 - Design and Analysis of Algorithms\n\nDescription: Algorithmic design strategies; Runtime analysis; Greedy; Divide-and-Conquer; Dynamic Programming; Network Flow; Algorithmic Intractability; P vs. NP vs. NP-Complete; Reduction Theory\n\nPrerequisite(s): CS 340 Minimum Grade of C AND\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall",
    "CS 463 - Cryptography\n\nDescription: Introduction to cryptology, cryptographic primitives, authentication, authorization, and access control, security models, cryptographic protocols, key management and establishment, applications.\n\nPrerequisite(s): MATH 224 Minimum Grade of C AND CS 447 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally",
    "CS 476 - Bioinformatics Algorithms\n\nDescription: This course concerns algorithms for bioinformatics problems arising from comparative genomics. Fundamental topics are pairwise sequence alignment, phylogenetic tree construction, and multiple sequence alignment.\n\nPrerequisite(s): CS 340 Minimum Grade of C AND\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally",
    "CS 482 - Computer Graphics\n\nDescription: Introduction to2D and 3D graphics, graphics hardware, scan conversion, anti-aliasing, hidden components, transformations, projections, ray tracing, curve and surface modeling, and animation.\n\nPrerequisite(s): CS 286 Minimum Grade of C AND MATH 152 Minimum Grade of C AND CS 150 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally",
    "CS 490 - Topics in Computer Science\n\nDescription: Selected topics in computer science. May be repeated to a maximum of 6 hours for different topics. Requires consent of instructor.\n\nRegistration Consent: Instructor\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall",
    "CS 495 - Independent Study\n\nDescription: Reading and research in specific areas of computer science. May be repeated for a maximum of 6 hours. Requires consent of department chair or program director.\n\nRegistration Consent: Instructor and Dept Chair\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall",
    "CS 499 - Senior Project: Software Implementation\n\nDescription: Second part of a two-semester sequence in which teams implement, test, and deploy software development project that was planned and designed in CS 425. Includes a formal presentation to the computer science faculty.\n\nPrerequisite(s): CS 425 Minimum Grade of C AND\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall",
    
    "English Language & Literature (ENG)\nENG 100G - Writing Lab-Grammar\n\nDescription: Computerized self-instructional materials for improving writing. GRM is prerequisite to 100R (Rhetoric). Not for English majors or minors.\n\nCredit Hours: 1\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall",
    "ENG 100R - Writing Lab-Rhetoric\n\nDescription: Computerized self-instructional materials for improving writing. Not for English majors or minors.\n\nPrerequisite(s): ENG 100G\n\nCredit Hours: 1\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall",
    "ENG 101 - English Composition I\n\nDescription: Instruction and practice in analyzing and composing the academic expository essay. IAI Course C1 900.\n\nPrerequisite(s): Evidence-based READ/WRIT Score (S11R) Minimum score of 530 OR ((ACT English (A01) Minimum score of 20 or WRIT/LANGUAGE Test Score (S14) Minimum Score of 27 or ACCUPLACER Writing (UA02) Minimum score of 250 or AD 090 Minimum grade of C) AND (ACT Reading (A03) Minimum score of 18 or Reading Test Score (S13) Minimum score of 24 or ACCUPLACER Reading (UA01) Minimum score of 237 or AD 082 Minimum grade of C or AD 116 Minimum grade of C))\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Fndtns/Written Expression 101IAI GECC-Communication/Speech",
    "ENG 101E - English Composition I\n\nDescription: Instruction and practice in analyzing and composing the academic expository essay.\n\nRegistration Consent: Advisor\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring\n\nAttribute(s): Fndtns/Written Expression 101IAI GECC-Communication/Speech",
    "ENG 101N - English Composition: Non-Native Speakers\n\nDescription: Instruction and practice in expository writing, including the paragraph and short essay. Course is a general education skills course. Requires consent of advisor.\n\nRegistration Consent: Advisor\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Spring; Fall\n\nAttribute(s): Fndtns/Written Expression 101",
    "ENG 102 - English Composition II\n\nDescription: Builds upon the analytical and writing skills developed in 101 with emphasis on argumentation and critical synthesis of information based on research. IAI Course C1 901R.\n\nPrerequisite(s): ENG 101 Minimum Grade of C OR ENG 101N Minimum Grade of C OR ENG 101E Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Fndtns/Written Expression 102IAI GECC-Communication/Speech",
    "ENG 102N - English Composition: Non-Native Speakers\n\nDescription: Instruction and practice in expository writing, including the essay and research paper. Course is a general education skills course. Requires consent of advisor.\n\nPrerequisite(s): ENG 101 Minimum Grade of C OR ENG 101N Minimum Grade of C OR ENG 101E Minimum Grade of C\n\nRegistration Consent: Advisor\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring\n\nAttribute(s): Fndtns/Written Expression 102",
    "ACS 103 - Interpersonal Communication Skills\n\nDescription: Principles and practices of oral communication emphasizing message formation and delivery; listening; perception; awareness of verbal and nonverbal codes; and managing conflict.\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Info & Comm in SocietyExp-Global Culture Race EquityExp-US Race Gender & EquityExp-United States CulturesFndtns/Oral Communication",
    
    "Reasoning and Argumentation (RA)\nRA 101 - Reasoning and Argumentation\n\nDescription: Students will learn to analyze, critically evaluate, and construct arguments. Topics include organizing information, detecting fallacies, analyzing meaning, and using effective methods of argumentation. IAI Course H4 906.\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Fndtns/Reasng & ArgumentationIAI GECC-Humanities",
    
    "Mathematics (MATH)\nMATH 112A - Math for Elementary Teaching: Number Sense & Algebra\n\nDescription: These courses are designed to meet state certification standards for elementary teachers. Number sense and algebra.\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall\n\nAttribute(s): Breadth-Physical Sciences",
    "MATH 112B - Math for Elementary Teaching: Probability, Statistics & Geometry\n\nDescription: These courses are designed to meet state certification standards for elementary teachers. Probability, statistics, and geometry.\n\nPrerequisite(s): MATH 112A Minimum Grade of C (concurrency allowed)\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall\n\nAttribute(s): Breadth-Physical Sciences",
    "MATH 112C - Mathematics for Elementary Teaching\n\nDescription: One of three courses designed to meet state certification standards for elementary teachers. College algebra skills essential for elementary teachers.\n\nPrerequisite(s): ALEKS PPL - Math Plcmnt 46 OR (MATH 112A Minimum Grade of C AND MATH 112B Minimum Grade of C)\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring\n\nAttribute(s): Breadth-Physical Sciences",
    "MATH 120 - College Algebra\n\nDescription: Cartesian coordinates; graphing; lines; parabolas; functions; inverses; roots of polynomials; rational functions and inequalities; linear systems; matrices; and determinants.\n\nPrerequisite(s): ALEKS PPL - Math Plcmnt 46\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Physical Sciences",
    "MATH 120E - Enhanced College Algebra\n\nDescription: Cartesian coordinates, graphing, lines, parabolas, functions, inverses, roots of polynomials, rational functions and inequalities, linear systems, matrices, and determinants\n\nPrerequisite(s): ALEKS PPL - Math Plcmnt 30 OR AD 070 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Physical Sciences",
    "MATH 120I - College Algebra\n\nDescription: Cartesian coordinates; graphing; lines; parabolas; functions; inverses; roots of polynomials; rational functions and inequalities; linear systems; matrices; and determinants.\n\nPrerequisite(s): ALEKS Placement Score < 30 (UL01 of 30 or less).\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Physical Sciences",
    "MATH 125 - Precalculus Mathematics with Trigonometry\n\nDescription: Exponential and logarithmic functions; trigonometric functions and their applications; inverse trigonometric functions; trigonometric identities and equations; laws of sines and cosines; binomial theorem; and introduction to partial fractions.\n\nPrerequisite(s): ALEKS PPL - Math Plcmnt 61 OR MATH 120 Minimum Grade of C OR MATH 120E Minimum Grade of C OR MATH 120I Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Physical Sciences",
    "MATH 145 - Calculus for the Life Sciences\n\nDescription: Fundamental concepts of calculus with applications focused on the life sciences: limits, continuity, derivatives, integrals, fundamental theorem of calculus, partial derivatives, differential equations, and applications. Course not a prerequisite for Math 152.\n\nPrerequisite(s): ALEKS PPL - Math Plcmnt 76 OR MATH 125 Minimum Grade of C\n\nCredit Hours: 5\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Physical Sciences",
    "MATH 150 - Calculus I\n\nDescription: Fundamental concepts of calculus: limits, continuity, and derivatives. Mean Value Theorem of Calculus, integration techniques, and applications. IAI Course M1 900-1.\n\nPrerequisite(s): ALEKS PPL - Math Plcmnt 76 OR MATH 125 Minimum Grade of C AND\n\nCredit Hours: 5\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Physical SciencesIAI GECC-Math",
    "MATH 152 - Calculus II\n\nDescription: Applications of integration; techniques of integration; improper integrals; polar coordinates; infinite sequences and series; and Taylor's theorem. IAI Course M1 900-2.\n\nPrerequisite(s): MATH 150 Minimum Grade of C AND\n\nCredit Hours: 5\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Physical SciencesIAI GECC-Math",
    "MATH 165 - Introduction to Programming and Problem Solving\n\nDescription: Introduction to real-world problem solving using a modern computational environment MATLAB. In the context of engineering applications, basic procedural programming concepts will be covered.\n\nPrerequisite(s): MATH 150 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally",
    "MATH 223 - Logic & Mathematical Reasoning\n\nDescription: Concepts and techniques essential to advanced mathematics; logic, methods of proof, sets, relations, induction, functions, cardinality, combinatorics, and graph theory.\n\nPrerequisite(s): MATH 150 Minimum Grade of C AND\n\nCredit Hours: 4\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall\n\nAttribute(s): Physical Sciences",
    "MATH 224 - Discrete Mathematics\n\nDescription: Mathematical concepts and techniques essential to computer science: logic; sets; algorithms; methods of proof; induction and recursion; simple counting techniques; and graph theory. Does not count toward a major in mathematics.\n\nPrerequisite(s): CS 140 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Physical Sciences",
    "MATH 250 - Calculus III\n\nDescription: Vectors; dot and cross products; lines and planes in space; and vector-valued functions. Partial derivatives, gradient, extrema, and multiple integrals. Theorems of Green, Stokes, and Gauss. IAI Course M1 900-3.\n\nPrerequisite(s): MATH 152 Minimum Grade of C\n\nCredit Hours: 4\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Physical SciencesIAI GECC-Math",
    "MATH 300 - History of Mathematics from Antiquity to Descartes\n\nDescription: The development of mathematics from antiquity through the development of analytic geometry. Does not count toward a degree in mathematics.\n\nPrerequisite(s): MATH 125 Minimum Grade of C OR MATH 150 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally\n\nAttribute(s): Physical Sciences",
    "MATH 305 - Differential Equations I\n\nDescription: First order ordinary differential equations, linear ordinary, differential equations of higher order, systems of first order linear equations, and applications.\n\nPrerequisite(s): MATH 250 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Physical Sciences",
    "MATH 310 - Teaching of Middle School Mathematics\n\nDescription: Constructing instructional objectives; formulating, utilizing and evaluating strategies for teaching mathematical concepts and skills; diagnosis and remediation of students' learning difficulties. Does not count towards a degree in mathematics.\n\nPrerequisite(s): MATH 112A Minimum Grade of C AND MATH 112B Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently\n\nAttribute(s): Physical Sciences",
    "MATH 311 - The Teaching of Secondary Mathematics 1\n\nDescription: The first of two courses focusing on the content and pedagogy applicable to secondary mathematics teacher licensure. Does not count toward non-teaching degree or minor in mathematics.\n\nCorequisite(s): CIED303\n\nRestriction(s): May not be enrolled as the following Classifications: Freshman, 1st Semester; Freshman; Sophomore\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring\n\nAttribute(s): Physical Sciences",
    "MATH 315 - Number Theory\n\nDescription: Divisibility, primes, numerical functions, congruences, introduction to coding theory, continued fractions, and rational approximations. Does not count toward a degree in mathematics.\n\nPrerequisite(s): MATH 125 Minimum Grade of C AND\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally\n\nAttribute(s): Physical Sciences",
    "MATH 320 - Introduction to Algebraic Structures\n\nDescription: Introduction to group theory. Groups; subgroups; cyclic groups; cosets and Lagrange's theorem; homomorphisms; and factor groups.\n\nPrerequisite(s): MATH 223 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Fall\n\nAttribute(s): Physical Sciences",
    "MATH 321 - Linear Algebra I\n\nDescription: Systems of linear equations matrices and determinants; vector spaces and linear transformations. Eigenvalues, eigenvectors, and diagonalization of a symmetric matrix.\n\nPrerequisite(s): MATH 152 Minimum Grade of C AND\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Physical Sciences",
    "MATH 340 - Theory of Interest\n\nDescription: Measures of interest; annuities; yield rates; amortization schedules and sinking funds; economic rationale for interest; and stochastic approaches to interest.\n\nPrerequisite(s): MATH 152 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Fall\n\nAttribute(s): Physical Sciences",
    "MATH 350 - Introduction to Analysis\n\nDescription: Real numbers. Topology on the real line. Sequences of real numbers; limits of functions, continuity of functions; differentiation.\n\nPrerequisite(s): MATH 223 Minimum Grade of C AND MATH 250 Minimum Grade of C\n\nCredit Hours: 4\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring\n\nAttribute(s): Physical Sciences",
    "MATH 355 - Engineering Mathematics\n\nDescription: Linear algebra: Gaussian elimination, linear independence, vector spaces, eigenvalues; discrete mathematics including: combinations and graph theory; and complex analysis (differentiation, integration, and series).\n\nPrerequisite(s): MATH 305 Minimum Grade of C\n\nCredit Hours: 5\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Fall\n\nAttribute(s): Physical Sciences",
    "MATH 400 - Development of Modern Mathematics\n\nDescription: The development of mathematics since the discovery of calculus.\n\nPrerequisite(s): MATH 152 Minimum Grade of C AND MATH 223 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Spring; Fall\n\nAttribute(s): Physical Sciences",
    "MATH 411 - The Teaching of Secondary Mathematics 2\n\nDescription: The second of two courses focusing on the content and pedagogy applicable to secondary mathematics teacher licensure. Does not count toward non-teaching degree or minor in mathematics.\n\nPrerequisite(s): MATH 311 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Fall\n\nAttribute(s): Physical Sciences",
    "MATH 416A - Mathematics Topics for Teachers: Analysis\n\nDescription: Analysis. May be repeated to a maximum of 3 hours so long as no topic is repeated. May not count toward a concentration or minor in mathematics. Requires consent of instructor.\n\nRegistration Consent: Instructor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Alternating Fall\n\nAttribute(s): Physical Sciences",
    "MATH 416B - Mathematics Topics for Teachers: Algebra\n\nDescription: Algebra. May be repeated to a maximum of 3 hours so long as no topic is repeated. May not count toward a concentration or minor in mathematics. Requires consent of instructor.\n\nRegistration Consent: Instructor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently\n\nAttribute(s): Physical Sciences",
    "MATH 416C - Mathematics Topics for Teachers: Number Theory\n\nDescription: Number theory. May be repeated to a maximum of 3 hours so long as no topic is repeated. May not count toward a concentration or minor in mathematics. Requires consent of instructor.\n\nRegistration Consent: Instructor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently\n\nAttribute(s): Physical Sciences",
    "MATH 416D - Mathematics Topics for Teachers: Probability & Statistics\n\nDescription: Probability and statistics. May be repeated to a maximum of 3 hours so long as no topic is repeated. May not count toward a concentration or minor in mathematics. Requires consent of instructor.\n\nRegistration Consent: Instructor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently\n\nAttribute(s): Physical Sciences",
    "MATH 416E - Mathematics Topics for Teachers: Mathematical Concepts\n\nDescription: Mathematical concepts. May be repeated to a maximum of 3 hours so long as no topic is repeated. May not count toward a concentration or minor in mathematics. Requires consent of instructor.\n\nRegistration Consent: Instructor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently\n\nAttribute(s): Physical Sciences",
    "MATH 416F - Mathematics Topics for Teachers: Geometry\n\nDescription: Geometry. May be repeated to a maximum of 3 hours so long as no topic is repeated. May not count toward a concentration or minor in mathematics. Requires consent of instructor.\n\nRegistration Consent: Instructor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally\n\nAttribute(s): Physical Sciences",
    "MATH 416G - Mathematics Topics for Teachers: History of Mathematics\n\nDescription: History of Mathematics. May be repeated to a maximum of 3 hours so long as no topic is repeated. May not count toward a concentration or minor in mathematics. Requires consent of instructor.\n\nRegistration Consent: Instructor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently\n\nAttribute(s): Physical Sciences",
    "MATH 416H - Mathematics Topics for Teachers: Applied Mathematics\n\nDescription: Applied mathematics. May be repeated to a maximum of 3 hours so long as no topic is repeated. May not count toward a concentration or minor in mathematics. Requires consent of instructor.\n\nRegistration Consent: Instructor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally\n\nAttribute(s): Physical Sciences",
    "MATH 416I - Mathematics Topics for Teachers: Logic & Foundations\n\nDescription: Logic and foundations. May be repeated to a maximum of 3 hours so long as no topic is repeated. May not count toward a concentration or minor in mathematics. Requires consent of instructor.\n\nRegistration Consent: Instructor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently\n\nAttribute(s): Physical Sciences",
    "MATH 420 - Abstract Algebra\n\nDescription: Rings, fields, integral domains, homomorphisms, factor rings, rings of polynomials, prime ideals, maximal ideals, extension fields, and vector spaces.\n\nPrerequisite(s): MATH 320 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Alternating Spring\n\nAttribute(s): Physical Sciences",
    "MATH 421 - Linear Algebra II\n\nDescription: Advanced study of vector spaces: Cayley-Hamilton Theorem, minimal and characteristic polynomials, Eigen spaces, canonical forms, Lagrange-Sylvester Theorem, and applications.\n\nPrerequisite(s): MATH 223 Minimum Grade of C AND MATH 250 Minimum Grade of C AND MATH 321 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall\n\nAttribute(s): Physical Sciences",
    "MATH 423 - Combinatorics and Graph Theory\n\nDescription: Methods of solving problems which are discrete in nature. Counting combinatorial reasoning and modeling; generating functions; and recurrence relations. Graphs: definitions, examples, basic properties, applications, and algorithms. Some knowledge of programming is recommended.\n\nPrerequisite(s): MATH 223\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally\n\nAttribute(s): Physical Sciences",
    "MATH 430 - A Geometric Introduction to Topology\n\nDescription: Topological spaces and equivalence through the study of knots, links, surfaces, 3-manifolds and other selected topics.\n\nPrerequisite(s): MATH 350 Minimum Grade of C AND\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally\n\nAttribute(s): Physical Sciences",
    "MATH 435 - Foundations for Euclidean & Non-Euclidean Geometry\n\nDescription: Points; lines; planes; space; separations; congruence; parallelism and similarity; non-Euclidean geometries; and independence of the parallel axiom. Riemannian and Bolyai-Lobachevskian geometries.\n\nPrerequisite(s): MATH 250 Minimum Grade of C AND MATH 321 Minimum Grade of C AND MATH 320 Minimum Grade of C OR MATH 350 Minimum Grade of C\n\nRegistration Consent: Instructor\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Fall\n\nAttribute(s): Physical Sciences",
    "MATH 437 - Differential Geometry\n\nDescription: Curves and surfaces in Euclidean 3-space from the perspective of classical differential geometry. Topics include: Frenet frames, fundamental surface forms, geodesics, and the Gauss-Bonnet theorem.\n\nPrerequisite(s): MATH 250 Minimum Grade of C AND MATH 321 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally\n\nAttribute(s): Physical Sciences",
    "MATH 450 - Real Analysis I\n\nDescription: Integration; infinite series, sequences and series of functions and their properties.\n\nPrerequisite(s): MATH 350 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Fall\n\nAttribute(s): Physical Sciences",
    "MATH 451 - Introduction to Complex Analysis\n\nDescription: Analytic functions, Cauchy-Riemann equations, harmonic functions, elements of conformal mapping, line integrals, Cauchy-Goursat theorem, Cauchy integral formula, power series, the residue theorem and applications.\n\nPrerequisite(s): MATH 350 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally\n\nAttribute(s): Physical Sciences",
    "MATH 462 - Applied Numerical Analysis\n\nDescription: Polynomial interpolation and approximations; numerical integration; differentiation; and direct and iterative methods for linear systems. Numerical solutions for ODE's and PDE's. Matlab programming required.\n\nPrerequisite(s): MATH 250 Minimum Grade of C AND MATH 305 Minimum Grade of C AND (CS 140 Minimum Grade of C OR CS 145 Minimum Grade of C OR MATH 165 Minimum Grade of C)\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Fall\n\nAttribute(s): Physical Sciences",
    "MATH 464 - Partial Differential Equations\n\nDescription: Partial differential equations, heat equation, wave equation, Laplace’s equation, Fourier series, Fourier transform, method of separations of variable.\n\nPrerequisite(s): MATH 223 Minimum Grade of C AND MATH 250 Minimum Grade of C AND MATH 305 Minimum Grade of C AND MATH 321 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Spring\n\nAttribute(s): Physical Sciences",
    "MATH 490A - Topics in Mathematics\n\nDescription: 490a-h, 1-3 each Topics in Mathematic — Selected topics in specified area of interest. (a) Algebra, (b) Geometry and topology, (c) Analysis, (d) Mathematics education, (e) Logic and foundations, (f) Differential equations, (g) Numerical analysis, (h) Combinatorics and graph theory. May be repeated to a maximum of 6 hours so long as no topic is repeated. Prerequisite: consent of instructor.\n\nRegistration Consent: Instructor\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally",
    "MATH 490B - Topics in Mathematics\n\nDescription: 490a-h, 1-3 each Topics in Mathematic — Selected topics in specified area of interest. (a) Algebra, (b) Geometry and topology, (c) Analysis, (d) Mathematics education, (e) Logic and foundations, (f) Differential equations, (g) Numerical analysis, (h) Combinatorics and graph theory. May be repeated to a maximum of 6 hours so long as no topic is repeated. Prerequisite: consent of instructor.\n\nRegistration Consent: Instructor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally",
    "MATH 490C - Topics in Mathematics\n\nDescription: 490a-h, 1-3 each Topics in Mathematic — Selected topics in specified area of interest. (a) Algebra, (b) Geometry and topology, (c) Analysis, (d) Mathematics education, (e) Logic and foundations, (f) Differential equations, (g) Numerical analysis, (h) Combinatorics and graph theory. May be repeated to a maximum of 6 hours so long as no topic is repeated. Prerequisite: consent of instructor.\n\nRegistration Consent: Instructor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally",
    "MATH 490D - Topics in Mathematics\n\nDescription: 490a-h, 1-3 each Topics in Mathematic — Selected topics in specified area of interest. (a) Algebra, (b) Geometry and topology, (c) Analysis, (d) Mathematics education, (e) Logic and foundations, (f) Differential equations, (g) Numerical analysis, (h) Combinatorics and graph theory. May be repeated to a maximum of 6 hours so long as no topic is repeated. Prerequisite: consent of instructor.\n\nRegistration Consent: Instructor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally",
    "MATH 490E - Topics in Mathematics\n\nDescription: 490a-h, 1-3 each Topics in Mathematic — Selected topics in specified area of interest. (a) Algebra, (b) Geometry and topology, (c) Analysis, (d) Mathematics education, (e) Logic and foundations, (f) Differential equations, (g) Numerical analysis, (h) Combinatorics and graph theory. May be repeated to a maximum of 6 hours so long as no topic is repeated. Prerequisite: consent of instructor.\n\nRegistration Consent: Instructor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently",
    "MATH 490F - Topics in Mathematics\n\nDescription: 490a-h, 1-3 each Topics in Mathematic — Selected topics in specified area of interest. (a) Algebra, (b) Geometry and topology, (c) Analysis, (d) Mathematics education, (e) Logic and foundations, (f) Differential equations, (g) Numerical analysis, (h) Combinatorics and graph theory. May be repeated to a maximum of 6 hours so long as no topic is repeated. Prerequisite: consent of instructor.\n\nRegistration Consent: Instructor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently",
    "MATH 490G - Topics in Mathematics\n\nDescription: 490a-h, 1-3 each Topics in Mathematic — Selected topics in specified area of interest. (a) Algebra, (b) Geometry and topology, (c) Analysis, (d) Mathematics education, (e) Logic and foundations, (f) Differential equations, (g) Numerical analysis, (h) Combinatorics and graph theory. May be repeated to a maximum of 6 hours so long as no topic is repeated. Prerequisite: consent of instructor.\n\nRegistration Consent: Instructor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally",
    "MATH 490H - Topics in Mathematics\n\nDescription: 490a-h, 1-3 each Topics in Mathematic — Selected topics in specified area of interest. (a) Algebra, (b) Geometry and topology, (c) Analysis, (d) Mathematics education, (e) Logic and foundations, (f) Differential equations, (g) Numerical analysis, (h) Combinatorics and graph theory. May be repeated to a maximum of 6 hours so long as no topic is repeated. Prerequisite: consent of instructor.\n\nRegistration Consent: Instructor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently",
    "MATH 495A - Independent Study: Algebra\n\nDescription: Research and reading in specified area of interest. Algebra. May be repeated to a maximum of 9 hours so long as no topic is repeated and not more than 3 hours are accumulated in neither a single segment nor more than 6 in one semester. Requires written consent of adviser and instructor.\n\nRegistration Consent: Instructor and Advisor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently\n\nAttribute(s): Physical Sciences",
    "MATH 495B - Independent Study: Geometry\n\nDescription: Research and reading in specified area of interest. Geometry. May be repeated to a maximum of 9 hours so long as no topic is repeated and not more than 3 hours are accumulated in neither a single segment nor more than 6 in one semester. Requires written consent of adviser and instructor.\n\nRegistration Consent: Instructor and Advisor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently\n\nAttribute(s): Physical Sciences",
    "MATH 495C - Independent Study: Analysis\n\nDescription: Research and reading in specified area of interest. Analysis. May be repeated to a maximum of 9 hours so long as no topic is repeated and not more than 3 hours are accumulated in neither a single segment nor more than 6 in one semester. Requires written consent of adviser and instructor.\n\nRegistration Consent: Instructor and Advisor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently\n\nAttribute(s): Physical Sciences",
    "MATH 495D - Independent Study: Mathematics Education\n\nDescription: Research and reading in specified area of interest. Mathematics education. May be repeated to a maximum of 9 hours so long as no topic is repeated and not more than 3 hours are accumulated in neither a single segment nor more than 6 in one semester. Requires written consent of adviser.\n\nRegistration Consent: Advisor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally\n\nAttribute(s): Physical Sciences",
    "MATH 495E - Independent Study: Logic & Foundations\n\nDescription: Research and reading in specified area of interest. Logic & foundations. May be repeated to a max of 9 hours so long as no topic is repeated and not more than 3 hours are accumulated in neither a single segment nor more than 6 in one semester. Requires written consent of adviser and instructor.\n\nRegistration Consent: Instructor and Advisor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently\n\nAttribute(s): Physical Sciences",
    "MATH 495F - Independent Study: Topology\n\nDescription: Research and reading in specified area of interest. Topology. May be repeated to a maximum of 9 hours so long as no topic is repeated and not more than 3 hours are accumulated in neither a single segment nor more than 6 in one semester. Requires written consent of adviser and instructor.\n\nRegistration Consent: Instructor and Advisor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently\n\nAttribute(s): Physical Sciences",
    "MATH 495G - Independent Study: Numerical Analysis\n\nDescription: Research and reading in specified area of interest. Numerical analysis. May be repeated to a max of 9 hours so long as no topic is repeated and not more than 3 hours are accumulated in neither a single segment nor more than 6 in one semester. Requires written consent of adviser and instructor.\n\nRegistration Consent: Instructor and Advisor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently\n\nAttribute(s): Physical Sciences",
    "MATH 498 - Senior Seminar\n\nDescription: Mathematical modeling. The writing and presenting of mathematical ideas. Preparation for senior project.\n\nPrerequisite(s): MATH 150 Minimum Grade of C AND MATH 152 Minimum Grade of C AND MATH 250 Minimum Grade of C AND MATH 223 Minimum Grade of C AND MATH 321 Minimum Grade of C AND MATH 350 Minimum Grade of C AND (CS 140 Minimum Grade of C OR CS 145 Minimum Grade of C) AND (PHYS 211A Minimum Grade of C OR PHYS 151 Minimum Grade of C) AND (PHYS 212A Minimum Grade of C OR PHYS 151L Minimum Grade of C)\n\nRestriction(s): Must be enrolled in one of the following Fields of Study (Major, Minor, or Concentration): Applied Math,Actuarial Science,Mathematical Studies,Mathematical Sciences,Statistics\n\nCredit Hours: 2\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Fall",
    "MATH 499 - Senior Project\n\nDescription: Directed study toward completing the senior assignment. Student completes a written project and gives an oral presentation.\n\nPrerequisite(s): MATH 498 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Fields of Study (Major, Minor, or Concentration): Applied Math,Actuarial Science,Mathematical Studies,Mathematical Sciences,Statistics\n\nRegistration Consent: Instructor\n\nCredit Hours: 2\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall",
    
    "STAT 244 - Statistics\n\nDescription: Summarizing data, including distributions, change and growth, relationships. Basics of survey design and experimental design. Inferential statistics, including confidence intervals and hypothesis testing. Credit may not be granted for both STAT 107 and STAT 244. IAI Course M1 902.\n\nPrerequisite(s): MATH 120 Minimum Grade of C OR MATH 120E Minimum Grade of C OR MATH 120I Minimum Grade of C OR MATH 125 Minimum Grade of C OR MATH 145 Minimum Grade of C OR MATH 150 Minimum Grade of C\n\nCredit Hours: 4\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Info & Comm in SocietyExperiences-LaboratoryIAI GECC-MathPhysical Sciences",
    "STAT 380 - Statistics For Applications\n\nDescription: Descriptive statistics; basic probability rules and distributions; inferences for means; variances and proportions; design and analysis of experiments; and regression analysis.\n\nPrerequisite(s): MATH 152 Minimum Grade of C AND\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Info & Comm in SocietyExperiences-LaboratoryPhysical Sciences",
    
    "Physics (PHYS)\nPHYS 111 - Concepts of Physics\n\nDescription: Introduction to our understanding of the universe and how it is achieved. Includes selections from: Motion, energy, heat, fluids, electricity, magnetism, sound, light, atoms. IAI Course P1 900.\n\nPrerequisite(s): AD 095 Minimum Grade of C AND AD 085 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring\n\nAttribute(s): Breadth-Physical SciencesIAI GECC-Physical Science",
    "PHYS 112 - Conceptual Physics Laboratory\n\nDescription: Weekly introductory laboratory dealing with mechanics, heat, electricity, sound and light. Emphasis placed on measurements and data analysis.\n\nPrerequisite(s): PHYS 111 (concurrency allowed)\n\nCorequisite(s): PHYS111\n\nCredit Hours: 1\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally\n\nAttribute(s): Breadth-Physical SciencesExperiences-Laboratory",
    "PHYS 115 - Energy and the Environment\n\nDescription: Problems and prospects of meeting national and worldwide energy demands. Scientific background, role, and environmental impact of fossil fuel, nuclear, solar, geothermal, and other technologies. IAI Course P1 901.\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently\n\nAttribute(s): Breadth-Physical SciencesIAI GECC-Physical Science",
    "PHYS 116 - Music and Acoustics\n\nDescription: Vibrations; nature and propagation of sound waves; musical pitch and intervals; tone quality, analysis, and synthesis; instruments; speech; ears and hearing; psychological aspects; and other topics. IAI Course P1 901.\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently\n\nAttribute(s): Breadth-Physical SciencesIAI GECC-Physical Science",
    "PHYS 117 - Light and Color\n\nDescription: Nature of light; ray and wave phenomena; optical devices; the eye; color theory; lasers and holography; applications to art, photography, and other visual media. IAI Course P1 901.\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently\n\nAttribute(s): Breadth-Physical SciencesIAI GECC-Physical Science",
    "PHYS 118 - Astronomy\n\nDescription: Introduction to observation; seasons; light; telescopes; orbits; solar system; stellar structure, evolution and classification; galaxies and cosmology. Includes in-class activities and supplemental viewing sessions. IAI Course P1 906.\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Physical SciencesIAI GECC-Physical Science",
    "PHYS 118L - Astronomy Laboratory\n\nDescription: An experiential laboratory course utilizing both software and real-time observation concerning astronomical objects.\n\nCorequisite(s): PHYS118\n\nCredit Hours: 1\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently\n\nAttribute(s): Breadth-Physical SciencesExperiences-Laboratory",
    "PHYS 120 - Frontiers in Physics: Past and Present\n\nDescription: Introductory course designed to highlight, through examples, how progress and discoveries are made in physics. Topics selected from historical and/or contemporary physics. May include seminar.\n\nPrerequisite(s): MATH 125 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Fall\n\nAttribute(s): Breadth-Physical Sciences",
    "PHYS 131 - College Physics I: Mechanics and Heat\n\nDescription: This course is the first semester of a two semester sequence. Designed to meet pre-medical and biological science requirements. Topics include mechanics, fluids, energy and heat and gravitation.\n\nPrerequisite(s): MATH 125 OR MATH 145 OR MATH 150 OR MATH 152\n\nCorequisite(s): PHYS131L\n\nCredit Hours: 4\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Physical Sciences",
    "PHYS 131L - College Physics I Laboratory: Mechanics and Heat\n\nDescription: This course is a laboratory for College Physics I. Topics include physical measurements, data analysis, lab reporting and error analysis.\n\nPrerequisite(s): MATH 125 OR MATH 145 OR MATH 150 OR MATH 152\n\nCorequisite(s): PHYS131\n\nCredit Hours: 1\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Physical SciencesExperiences-Laboratory",
    "PHYS 132 - College Physics II: Electricity, Magnetism and Optics\n\nDescription: This course is the second semester of a two semester sequence. Designed to meet pre-medical and biological science requirements. Topics include waves and sound, electrostatics, circuits magnetism, EM waves, optics and modern physics theory.\n\nPrerequisite(s): PHYS 131\n\nCorequisite(s): PHYS132L\n\nCredit Hours: 4\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Physical Sciences",
    "PHYS 132L - College Physics II Laboratory: Electricity, Magnetism and Optics\n\nDescription: A lab consisting of experiments designed to complement PHYS 132: physical measurements, data analysis, presentation and error analysis.\n\nPrerequisite(s): PHYS 131L\n\nCorequisite(s): PHYS132\n\nCredit Hours: 1\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Physical SciencesExperiences-LaboratoryScience Lab Course",
    "PHYS 140 - Introduction to Physics and Physical Reasoning\n\nDescription: An introduction to physics and quantitative reasoning preparatory for PHYS 141/151. Selected physics concepts, methods of reasoning, application of mathematics to physics problem solving.\n\nPrerequisite(s): MATH 150 Minimum Grade of C (concurrency allowed)\n\nCredit Hours: 2\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall\n\nAttribute(s): Breadth-Physical Sciences",
    "PHYS 141 - Physics I for Engineers\n\nDescription: Introductory calculus-based course for engineering students: Motion, kinematics, dynamics, Newton's Laws, applications; work; kinetic & potential energy, momentum; rotational dynamics, angular momentum; gravity; oscillations.\n\nPrerequisite(s): (MATH 152 Minimum Grade of C (concurrency allowed) OR MATH 250 Minimum Grade of C (concurrency allowed)) AND (ACT Math 28 OR Physics Readiness Exam Score 09 OR MATH TEST SCORE 32.5 OR PHYS 140 Minimum Grade of C)\n\nCorequisite(s): PHYS151L\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall\n\nAttribute(s): Breadth-Physical Sciences",
    "PHYS 142 - Physics II for Engineering\n\nDescription: Calculus-based course for engineering students: electric charge, electric fields, Gauss' law, electric potential; magnetic fields, Faraday's Law, inductance, Maxwell's equations integral form; electromagnetic waves.\n\nPrerequisite(s): (PHYS 141 Minimum Grade of C OR PHYS 151 Minimum Grade of C) AND MATH 152 Minimum Grade of C AND PHYS 151L Minimum Grade of C\n\nCorequisite(s): PHYS152L\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall\n\nAttribute(s): Breadth-Physical Sciences",
    "PHYS 151 - University Physics I\n\nDescription: Kinematics; dynamics; planar motion; work and energy; momentum; rotational motion; gravitation; and fluids. IAI Course P2 900.\n\nPrerequisite(s): MATH 152 Minimum Grade of C (concurrency allowed)\n\nCorequisite(s): PHYS151L\n\nCredit Hours: 4\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Physical SciencesIAI GECC-Physical Science",
    "PHYS 151L - University Physics I Laboratory\n\nDescription: Physics measurements; data analysis and presentation, error analysis. Velocity; acceleration; force and moments; work and kinetic energy. IAI Course P2 900L.\n\nPrerequisite(s): PHYS 151 Minimum Grade of C (concurrency allowed) OR PHYS 141 Minimum Grade of C (concurrency allowed) OR PHYS 211A Minimum Grade of C\n\nCredit Hours: 1\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Physical SciencesExperiences-LaboratoryIAI GECC-Science Lab",
    "PHYS 152 - University Physics II\n\nDescription: Bulk properties of matter; oscillations and waves; electric charge; electric fields; Gauss' law; potentials; circuits; magnetic fields; and electromagnetic waves.\n\nPrerequisite(s): MATH 152 Minimum Grade of C AND (PHYS 151 Minimum Grade of C OR PHYS 141 Minimum Grade of C)\n\nCorequisite(s): PHYS152L\n\nCredit Hours: 4\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Physical Sciences",
    "PHYS 152L - University Physics II Lab\n\nDescription: Physics measurements; data analysis and presentation; error analysis; thermal and bulk properties of matter; simple harmonic motion and waves; electromagnetism; simple circuits; and optics.\n\nCredit Hours: 1\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Physical SciencesExperiences-Laboratory",
    "PHYS 192 - Freshman Project in Biomedical Physics\n\nDescription: With guidance, a freshman investigatory or independent study project in bio- or biomedical physics. Open to all students of other disciplines and to 100-level physics students.\n\nRegistration Consent: Instructor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently",
    "PHYS 193 - Freshman Project in Photonics and Laser Physics\n\nDescription: With guidance, a freshman investigatory or independent study project in photonics. Open to all students of other disciplines and to 100-level physics students.\n\nRegistration Consent: Instructor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently",
    "PHYS 196 - Freshman Project in Astronomy\n\nDescription: With guidance, a freshman investigatory or independent project in astronomy. Open to all students of other disciplines and to 100-level physics students.\n\nRegistration Consent: Instructor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally",
    "PHYS 197 - Freshman Project in Experimental Physics\n\nDescription: With guidance, a freshman investigatory or independent study project in experimental physics. Open to all students of other disciplines and to 100-level physics students.\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently",
    "PHYS 198 - Freshman Project in Theoretical Physics\n\nDescription: With guidance, a freshman investigatory or independent study project in theoretical physics. Open to all students of other disciplines and to 100-level physics students.\n\nRegistration Consent: Instructor\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently",
    "PHYS 201 - University Physics III\n\nDescription: Electromagnetic waves. Physical optics: interference and diffraction. Introductory special relativity; thermodynamic laws; Maxwell Boltzmann distributions; equipartition theorem; black-body radiation; and evidence for photons. Bohr atom and matter waves.\n\nPrerequisite(s): (PHYS 151 Minimum Grade of C OR PHYS 211A Minimum Grade of C) AND (PHYS 152 Minimum Grade of C OR PHYS 211B Minimum Grade of C)\n\nCredit Hours: 4\n\nNext available term: Spring 2024\n\nTerm frequency: Spring\n\nAttribute(s): Breadth-Physical Sciences",
    "PHYS 201L - University Physics III Laboratory\n\nDescription: Laboratories covering select topics from Electromagnetic waves, physical optics, introductory special relativity, thermodynamic laws, and introductory quantum physics.\n\nCorequisite(s): PHYS201\n\nCredit Hours: 1\n\nNext available term: Spring 2024\n\nTerm frequency: Spring\n\nAttribute(s): Breadth-Physical SciencesExperiences-Laboratory",

    "Chemistry (CHEM)\nCHEM 113 - Introduction to Chemistry\n\nDescription: Preparation for University Chemistry. Mathematical techniques, problem solving, chemical terms, concepts, and laws. For students with inadequate preparation in high school chemistry. Three lecture hours and one problem session per week.\n\nPrerequisite(s): ALEKS PPL - Math Plcmnt 30\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Physical Sciences",
    "CHEM 120A - General, Organic, and Biological Chemistry\n\nDescription: Not for Chemistry majors. General chemistry. Three lecture hours and one laboratory per week. Must be taken in sequence. IAI Course P1 902.\n\nCorequisite(s): CHEM124A\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Physical SciencesIAI GECC-Physical Science",
    "CHEM 120B - General, Organic, and Biological Chemistry\n\nDescription: Primarily for students planning careers in Nursing and Allied Health professions. Not for Chemistry majors. Organic and biological Chemistry. Three lecture hours and one laboratory per week. Must be taken in sequence.\n\nPrerequisite(s): CHEM 120A\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Physical Sciences",
    "CHEM 121A - General Chemistry\n\nDescription: University-level modern chemistry for science and engineering students, atomic structure, molecular bonding, structure, stoichiometry, chemical change, equilibrium, and qualitative analysis. Four lecture hours per week. Must be taken in sequence. IAI Course P1 902, CHM 911.\n\nPrerequisite(s): (MATH 120 Minimum Grade of C OR MATH 120E Minimum Grade of C OR MATH 120I Minimum Grade of C AND CHEM 113 Minimum Grade of C) OR MATH 125 Minimum Grade of C (concurrency allowed) OR MATH 145 Minimum Grade of C (concurrency allowed) OR MATH 150 Minimum Grade of C (concurrency allowed) OR ALEKS PPL - Math Plcmnt 61 OR Chemistry Readiness Exam Score 39 OR (Chemistry Readiness Exam Score 34 AND CRE General Math Subscore 17)\n\nCredit Hours: 4\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Physical SciencesIAI GECC-Physical ScienceIM-Chemistry",
    "CHEM 121B - General Chemistry\n\nDescription: University-level modern chemistry for science and engineering students. Atomic structure, molecular bonding, structure, stoichiometry, chemical change, equilibrium, and qualitative analysis. Four lecture hours per week. Must be taken in sequence. IAI Course CHM 912.\n\nPrerequisite(s): CHEM 121A Minimum Grade of C\n\nCredit Hours: 4\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Physical SciencesIM-Chemistry",
    "CHEM 124A - General, Organic, and Biological Chemistry Laboratory\n\nDescription: Safety practices and basic techniques. Topics complement CHEM 120. Not for Chemistry majors. General and organic Chemistry. Three laboratory hours per week. Must be taken in sequence. This course replaces CHEM 120A-Lab portion. IAI Course P1 902L.\n\nCorequisite(s): CHEM120A\n\nCredit Hours: 1\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Physical SciencesExperiences-LaboratoryIAI GECC-Science Lab",
    "CHEM 124B - General, Organic, and Biological Chemistry Laboratory\n\nDescription: Safety practices and basic techniques. Topics complement CHEM 120. Not for Chemistry majors. (A)General and Organic Chemistry. Three laboratory hours per week. Must be taken in sequence. Replaces CHEM 120B-Lab portion.\n\nPrerequisite(s): CHEM 124A\n\nCorequisite(s): CHEM120B\n\nCredit Hours: 1\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Physical SciencesExperiences-Laboratory",
    "CHEM 131 - Engineering Chemistry\n\nDescription: Fundamental principles of chemistry especially for students planning careers in engineering fields. Concepts represent the basic principles of chemistry with emphasis on engineering applications.\n\nPrerequisite(s): (MATH 120 Minimum Grade of C OR MATH 120E Minimum Grade of C OR MATH 120I Minimum Grade of C AND CHEM 113 Minimum Grade of C) OR MATH 125 Minimum Grade of C (concurrency allowed) OR MATH 145 Minimum Grade of C (concurrency allowed) OR MATH 150 Minimum Grade of C (concurrency allowed) OR ALEKS PPL - Math Plcmnt 61 OR Chemistry Readiness Exam Score 39 OR (Chemistry Readiness Exam Score 34 AND CRE General Math Subscore 17)\n\nCredit Hours: 4\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall\n\nAttribute(s): Breadth-Physical Sciences",
    "CHEM 135 - Engineering Chemistry Lab\n\nDescription: Chemical laboratory experiments with an emphasis on engineering applications. Laboratory safety practices, techniques, qualitative and quantitative analysis, chemical change and equilibria. One three-hour laboratory per week.\n\nCorequisite(s): CHEM131\n\nCredit Hours: 1\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall\n\nAttribute(s): Breadth-Physical SciencesExperiences-Laboratory",

    "Biological Sciences (BIOL)\nBIOL 111 - Contemporary Biology\n\nDescription: Contributions of biology to understanding ourselves and our world. Development, nature and human implications of cell theory, heredity, the modern synthetic theory of evolution, population dynamics, ecology and environmental problems. Not for biological sciences major credit. IAI Course L1 900.\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Life SciencesIAI GECC-Life Science",
    "BIOL 140 - Human Biology\n\nDescription: Introduction and application of basic human biology concepts, including cell theory, genetics, systems biology, and evolution. Not for biological sciences major credit. Three lectures per week. IAI Course L1 904.\n\nRestriction(s): May not be enrolled as one of the following Majors: Biological Sciences\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Life SciencesIAI GECC-Life Science",
    "BIOL 145 - Fundamentals of Biology\n\nDescription: Introduction to basic biology concepts, including cell theory, genetics, systems biology, and evolution. Lab required. Not for biological sciences major credit.\n\nRestriction(s): May not be enrolled as one of the following Majors: Biological Sciences\n\nCredit Hours: 4\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently\n\nAttribute(s): Breadth-Life SciencesExperiences-Laboratory",
    "BIOL 150 - Introduction to Biological Sciences I\n\nDescription: First of a two-course sequence, introduction to biochemistry, molecular genetics, cell structure and function, and evolution. Lab required. IAI Course BIO LI 900L, BIOL 910.\n\nPrerequisite(s): CHEM 121A Minimum Grade of C (concurrency allowed)\n\nCredit Hours: 4\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Life SciencesExperiences-LaboratoryIAI GECC-Science LabIM-Biological Sciences",
    "BIOL 151 - Introduction to Biological Sciences II\n\nDescription: Second of a two-course sequence, introduction to major taxonomic groups with emphasis on evolutionary relationships and ecological principles. Lab required. IAI Course BIO 910.\n\nPrerequisite(s): BIOL 150 Minimum Grade of C AND CHEM 121A Minimum Grade of C AND CHEM 125A Minimum Grade of C\n\nCredit Hours: 4\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Life SciencesExperiences-LaboratoryIM-Biological Sciences",
    "BIOL 240A - Human Anatomy & Physiology\n\nDescription: Functional architecture of the human body. Tissues, skeletal, muscular and nervous systems. Not for major credit.\n\nPrerequisite(s): (BIOL 140 Minimum Grade of C OR BIOL 150 Minimum Grade of C OR BIOL 151 Minimum Grade of C) AND (CHEM 120A Minimum Grade of C OR CHEM 120N Minimum Grade of C OR CHEM 121A Minimum Grade of C)\n\nCredit Hours: 4\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Life SciencesExperiences-Laboratory",
    "BIOL 240B - Human Anatomy & Physiology\n\nDescription: Continuation of BIOL240A. Endocrine, Circulatory, Respiratory, Digestive, Urinary systems. Not for major credit.\n\nPrerequisite(s): BIOL 240A Minimum Grade of C\n\nCredit Hours: 4\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Life SciencesExperiences-HealthExperiences-Laboratory",
    "Electrical & Comp. Engineering (ECE)\nECE 145 - Introduction to Computer Programming\n\nDescription: Specification, design, implementation, testing, debugging, applications in numerical analysis and computer simulations. Control structures, functions, arrays and other data types. Programming in C, Python, and Matlab.\n\nPrerequisite(s): MATH 120 Minimum Grade of C OR MATH 120E Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently\n\nAttribute(s): Breadth-Info & Comm in Society",
    "ECE 198 - Electrical and Computer Engineering Work Experience I\n\nDescription: Supervised work experience with agency, firm, or organization which uses engineers. Intended for students who have part-time cooperative experience jobs. Limited to students enrolled in more than 6 credit hours. Student must be a declared major in electrical and computer engineering.\n\nRestriction(s): May not be enrolled as the following Classifications: Freshman, 1st Semester; FreshmanMust be enrolled in one of the following Colleges: School of Engineering\n\nRegistration Consent: Instructor\n\nCredit Hours: 0\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Cooperative Education Course",
    "ECE 199 - Electrical and Computer Engineering Cooperative Education I\n\nDescription: Supervised work experience with agency, firm, or organization which uses engineers. First work period of five year academic/work experience program. Requires consent of advisor.\n\nRestriction(s): May not be enrolled as the following Classifications: Freshman, 1st Semester; FreshmanMust be enrolled in one of the following Colleges: School of Engineering\n\nRegistration Consent: Advisor\n\nCredit Hours: 0\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Cooperative Education Course",
    "ECE 210 - Circuit Analysis I\n\nDescription: DC and AC steady-state circuit analysis. Loop and nodal analysis; network theorems; phasors; complex power; and single-phase and three-phase circuits. IAI Course EGR 931.\n\nPrerequisite(s): MATH 150 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 0 to 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): IM-Engineering",
    "ECE 211 - Circuit Analysis II\n\nDescription: Time-domain transient analysis; complex frequency; frequency response; two-port networks; Laplace transform techniques; and impulse response and convolution. Three hours lecture and one laboratory session per week.\n\nPrerequisite(s): ECE 210 Minimum Grade of C AND MATH 305 Minimum Grade of C (concurrency allowed) AND MATH 150 Minimum Grade of C AND MATH 152 Minimum Grade of C AND MATH 250 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 0 to 4\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall",
    "ECE 282 - Digital Systems Design\n\nDescription: Concepts and design of computer circuitry; binary number systems; study of microprocessors and assembly language programming. Introduction to Verilog HDL. Laboratory exercises involve circuit implementation and programming. Three lecture hours and one laboratory session per week. Student must be a declared major in an engineering discipline. IAI Course EGR 932L.\n\nPrerequisite(s): CS 140 Minimum Grade of C OR CS 145 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 0 to 4\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): IM-Engineering",
    "ECE 298 - Electrical and Computer Engineering Work Experience II\n\nDescription: Supervised work experience with agency, firm, or organization which uses engineers. Intended for students who have part-time cooperative experience jobs. Limited to students enrolled in more than 6 credit hours.\n\nRestriction(s): May not be enrolled as the following Classifications: Freshman, 1st Semester; FreshmanMust be enrolled in one of the following Colleges: School of Engineering\n\nRegistration Consent: Instructor\n\nCredit Hours: 0\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Cooperative Education Course",
    "ECE 299 - ECE Cooperative Education II\n\nDescription: Supervised work experience with agency, firm, or organization which uses engineers. Second work period of five year academic/work experience program. Requires consent of advisor.\n\nRestriction(s): May not be enrolled as the following Classifications: Freshman, 1st Semester; FreshmanMust be enrolled in one of the following Colleges: School of Engineering\n\nRegistration Consent: Advisor\n\nCredit Hours: 0\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Cooperative Education Course",
    "ECE 326 - Electronic Circuits I\n\nDescription: Introduction to semiconductors; diode, transistor and FET; small and large signal analysis; and logic gate families and design. Three hours lecture and one laboratory session per week. Student must be a declared major in an engineering discipline.\n\nPrerequisite(s): ECE 211 Minimum Grade of C AND MATH 305 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 0 to 4\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Spring; Fall",
    "ECE 340 - Engineering Electromagnetics\n\nDescription: Introduction to engineering electromagnetics. Includes vector analysis, time-harmonic fields, electromagnetic wave propagation, transmission lines, waveguides, antennas.\n\nPrerequisite(s): (PHYS 152 Minimum Grade of C OR PHYS 211B Minimum Grade of C) AND (PHYS 152L Minimum Grade of C OR PHYS 212B Minimum Grade of C) AND ECE 211 Minimum Grade of C AND MATH 305 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 0 to 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall",
    "ECE 341 - Princ w/Electro Mec Enrg Conv\n\nDescription: Basic electromagnetic concepts; energy-based torque and force and calculations; transformers; induction machines; synchronous machines; and DC machines. Three hours lecture and one laboratory session per week.\n\nPrerequisite(s): ECE 340 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 0 to 4\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Spring; Fall",
    "ECE 351 - Signals and Systems\n\nDescription: Basics of continuous and discrete signals and systems. Convolution; Fourier analysis; filtering; modulation and sampling; and Z-transforms. Student must be a declared major in an engineering discipline.\n\nPrerequisite(s): ECE 211 Minimum Grade of C AND MATH 305 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Majors: Electrical EngineeringMust be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Summer; Spring; Fall",
    "ECE 352 - Engineering Probability and Statistics\n\nDescription: Probability; random variables and probability distributions; statistics; Monte-Carlo simulations; estimation theory; decision theory; hypothesis testing; random processes; and linear system response to random processes.\n\nPrerequisite(s): ECE 351 Minimum Grade of C (concurrency allowed)\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Spring; Fall",
    "ECE 365 - Control Systems\n\nDescription: Mechanical and electrical systems modeling, signal flow graphs, state variable approach, root-locus approach, Bode ploys/Nyquist plots, frequency domain design and Proportional-Integral-Derivative (PID) controller turning methods.\n\nPrerequisite(s): ECE 351 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall",
    "ECE 375 - Introduction to Communications\n\nDescription: Time- and frequency-domain analysis; and bandwidth, distortion, and noise. Baseband pulse transmission; sampling; pulse shaping. Digital and analog modulation techniques. Analysis of bit-error probability.\n\nPrerequisite(s): ECE 351 Minimum Grade of C AND ECE 352 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall",
    "ECE 381 - Microcontrollers\n\nDescription: Interfacing and programming microcontrollers to measure/control various hardware and signals, GPIO, LCD, ISRs, encoders, UART/RS-232, I2C, SPI, ADC/DAC. Three hours lecture and one laboratory session per week.\n\nPrerequisite(s): ECE 282 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall",
    "ECE 398 - Electrical and Computer Engineering Work Experience III\n\nDescription: Supervised work experience with agency, firm, or organization which uses engineers. Intended for students who have part-time cooperative experience jobs. Limited to students enrolled in more than 6 credit hours.\n\nRestriction(s): May not be enrolled as the following Classifications: Freshman, 1st Semester; FreshmanMust be enrolled in one of the following Colleges: School of Engineering\n\nRegistration Consent: Instructor\n\nCredit Hours: 0\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Cooperative Education Course",
    "ECE 399 - ECE Cooperative Education III\n\nDescription: Supervised work experience with agency, firm, or organization which uses engineers. Third work period of five year academic/work experience program. Requires consent of advisor.\n\nRestriction(s): May not be enrolled as the following Classifications: Freshman, 1st Semester; Freshman; SophomoreMust be enrolled in one of the following Colleges: School of Engineering\n\nRegistration Consent: Advisor\n\nCredit Hours: 0\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Cooperative Education Course",
    "ECE 404 - Electrical and Computer Engineering Design\n\nDescription: Design overview, methodologies, considerations, constraints, scheduling, and management. Focus on both oral and written communication. Students work in teams while rotating leadership responsibilities.\n\nPrerequisite(s): ECE 282 Minimum Grade of C AND ECE 351 Minimum Grade of C AND (ECE 365 Minimum Grade of C OR ECE 375 Minimum Grade of C OR ECE 381 Minimum Grade of C)\n\nRestriction(s): May not be enrolled as the following Classifications: Freshman, 1st Semester; Freshman; Junior; SophomoreMust be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall",
    "ECE 405 - Electrical and Computer Engineering Design Laboratory\n\nDescription: Realization of a term-based senior project, including construction, computer simulation, debug, and test as required by the project to obtain a functional prototype.\n\nPrerequisite(s): ECE 404 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall",
    "ECE 426 - High Frequency Design\n\nDescription: High frequency circuit design with elements of RF engineering. Amplifiers, oscillators, modulators, impedance matching, switching, signal integrity, and tuning.\n\nPrerequisite(s): ECE 326 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Fall",
    "ECE 427 - Knowledge-Based Systems\n\nDescription: Engineering-oriented perspective on artificial intelligence (AI) technology. General AI concepts and specifically knowledge-based intelligent systems and machine learning applied to engineering problem-solving.\n\nPrerequisite(s): CS 140 Minimum Grade of C OR CS 145 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Summer",
    "ECE 428 - Analog Filter Design\n\nDescription: Active and passive filter synthesis. Standard low-pass approximations: Butterworth, Chebyshev, Inverse Chebyshev, Cauer, Bessel and frequency transformations. Active and passive circuit implementations.\n\nPrerequisite(s): ECE 351 Minimum Grade of C AND ECE 326 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Fall",
    "ECE 429 - Bioinstrumentation\n\nDescription: Design and use of biosignal sensors, bioamplifiers, and filters for measuring physiological data; emphasizes origins and characteristics of nerve and heart signals; includes cell analysis and dialysis machine design.\n\nPrerequisite(s): ECE 327 with a C or better; or graduate standing in Engineering.\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally",
    "ECE 433 - Fuzzy Logic and Applications\n\nDescription: Fundamentals of fuzzy sets, basic operations, fuzzy arithmetic, and fuzzy systems. Examples of applications in various fields of engineering and science.\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently",
    "ECE 436 - Digital Signal Processing\n\nDescription: Discrete-time signals and systems; sampling; z-transforms; discrete Fourier transform; difference equations; design and implementation of digital filters; and DSP development systems.\n\nPrerequisite(s): ECE 351 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Spring; Fall",
    "ECE 437 - Medical Imaging Systems\n\nDescription: Basic signals and systems, imaging principles, and image quality measures for X-ray radiography, X-ray computed tomography, ultrasound, and magnetic resonance imaging.\n\nPrerequisite(s): ECE 351 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally",
    "ECE 438 - Image Analysis and Computer Vision\n\nDescription: Image formation, geometrical and topological properties of binary images; image filtering; boundary detection; image segmentation; and pattern recognition. Two hours lecture and one laboratory session per week.\n\nPrerequisite(s): ECE 351 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Fall",
    "ECE 439 - Digital Image Processing\n\nDescription: Fundamentals of human perception; sampling and quantization; image transforms; enhancement; and restoration and coding. Two hours lecture and one laboratory session per week.\n\nPrerequisite(s): ECE 351 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring",
    "ECE 441 - Finite Element Analysis and Design of Electrical Machines\n\nDescription: Practical design of electrical machines based on finite element analysis.\n\nPrerequisite(s): ECE 341 or equivalent courses with C or better or admission to graduate ENGE program.\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally",
    "ECE 444 - Power Electronics\n\nDescription: Basics of DC/DC and DC/AC conversion, inductors, transformers, switching characteristics of semiconductor devices, elements of electromagnetic compatibility.\n\nPrerequisite(s): ECE 326 with C or better or admission to graduate Engineering Program.\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring",
    "ECE 445 - Power Distribution System\n\nDescription: Distribution system planning; load characteristics; application of distribution transformers; design of distribution system; voltage-drop and power-loss calculations; voltage regulation; and protection and reliability.\n\nPrerequisite(s): ECE 341 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Spring",
    "ECE 446 - Power System Analysis\n\nDescription: Synchronous machines; power transformers; transmission lines; system modeling; load-flow study; economic operation of power systems; symmetrical components; symmetrical and unsymmetrical faults; and power system stability.\n\nPrerequisite(s): ECE 341 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Summer",
    "ECE 447 - Radar Systems\n\nDescription: Introduction to radar systems, including antenna fundamentals, radar equation, radar signals and systems, CW radar, FM-CW Radar, pulse radar, and tracking radar.\n\nPrerequisite(s): ECE 340 Minimum Grade of C AND ECE 351 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring",
    "ECE 455 - System Modeling & Optimization\n\nDescription: Mathematical modeling of engineering systems; dynamic response of electrical and mechanical systems; and optimization models in electrical engineering.\n\nPrerequisite(s): ECE 351 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally",
    "ECE 465 - Control Systems Design\n\nDescription: Root-locus analysis; frequency-response analysis; design and compensation technique; describing-function analysis of nonlinear control systems; and analysis and design by state-space methods.\n\nPrerequisite(s): ECE 365 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Fall",
    "ECE 466 - Digital Control\n\nDescription: Topics include finite difference equations; Z-transforms and state variable representation; analysis and synthesis of linear sampled-data control systems using classical and modern control theory. Same as ME 466.\n\nPrerequisite(s): ME 450 Minimum Grade of C OR ECE 365 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally",
    "ECE 467 - Robotics-Dynamics and Control\n\nDescription: (Same as ME 454 and MRE 454) Robotics; robot kinematics and inverse kinematics; trajectory planning; differential motion and virtual work principle; and dynamics and control.\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nRegistration Consent: Instructor\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Fall",
    "ECE 475 - Communication Systems\n\nDescription: Digital transmission through band-limited channels; optimum receiver principles; symbol synchronization; channel capacity and coding; Bandpass digital modulation; and case studies of communication systems.\n\nPrerequisite(s): ECE 375 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently",
    "ECE 476 - Electronic Circuits II\n\nDescription: Small signal analysis, transistor amplifier design, frequency response, feedback system analysis, output stage design, signal generation and waveform shaping circuits. Three hour lecture and one hour laboratory session per week.\n\nPrerequisite(s): ECE 326 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring",
    "ECE 477 - Network Engineering\n\nDescription: Principles and practices of network engineering with particular emphasis on the physical, data-link, and network layers as applied to telecommunication and computing systems.\n\nPrerequisite(s): ECE 282 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Fall",
    "ECE 482 - Microprocessor System\n\nDescription: Design of microprocessor systems using VLSI building blocks. Several microprocessors and peripheral ICS studied laboratory experiments with microprocessor systems using logic analyzers. Three hours lecture and one laboratory session per week.\n\nPrerequisite(s): ECE 282 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 0 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Fall",
    "ECE 483 - Advanced Digital Systems Engineering\n\nDescription: Design of digital systems using a hardware description language, and logic synthesis tools. Three hours lecture and one laboratory session per week.\n\nPrerequisite(s): ECE 282 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 0 to 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring",
    "ECE 484 - Digital VLSI Design\n\nDescription: Discussion of CMOS circuits, MOS transistor theory, CMOS processing technology, circuit characterization, and CMOS Circuit and Logic Design.\n\nPrerequisite(s): ECE 326 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Fall",
    "ECE 485 - Embedded Power Electronics Controllers\n\nDescription: Practical approach to programming dedicated microprocessor systems, communication links, sensor signal conditioning, gate driver, inner and outer control loops, power startup, and user interface.\n\nPrerequisite(s): ECE 282 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally",
    "ECE 491 - Independent Study\n\nDescription: Individual investigation of a topic in electrical engineering to be agreed upon with the instructor. May be repeated to a maximum of 6 hours provided no topic is repeated. Requires consent of instructor.\n\nRestriction(s): Must be enrolled in one of the following Majors: Computer Engineering,Computer Engineering,Electrical Engineering\n\nRegistration Consent: Instructor\n\nCredit Hours: 1 to 4\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Summer; Spring; Fall",
    "ECE 492 - Topics in Electrical and Computer Engineering\n\nDescription: Selected topics of special interest. Course schedule will include name of topic. May be repeated to a maximum of 6 hours so long as no topic is repeated. Requires consent of instructor.\n\nRestriction(s): Must be enrolled in one of the following Colleges: School of Engineering\n\nRegistration Consent: Instructor\n\nCredit Hours: 2 to 6\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall",

    "Public Health (PBHE)\nPBHE 111 - Personal Health\n\nDescription: This seminar will introduce students to basic concepts in personal health and wellness.\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Experiences-Health",
    "PBHE 210 - Sexual Health\n\nDescription: Surveys the dynamics of sexual health as related to overall health. Identifies and examines basic issues in human sexuality as relating to larger society.\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Experiences-Health",
    "PBHE 213 - Violence and Injury Prevention\n\nDescription: Provides a broad understanding of violence and injury as a public health issue. Stresses importance of prevention initiatives, environmental modifications, legal interventions, and advocacy.\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Spring\n\nAttribute(s): Experiences-Health",
    "PBHE 220 - Drug Use and Abuse\n\nDescription: Drug and non-drug alternatives that modify mood and behavior; factors influencing use, effects, and legal control; students' personal values, motivations and choices concerning drug use.\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Fall\n\nAttribute(s): Experiences-Health",
    "PBHE 230 - Emotional Health and Stress Management\n\nDescription: An introduction to a variety of types of positive and negative emotions and their determinants in addition to their contributions to an individual's overall well-being.\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring\n\nAttribute(s): Experiences-Health",
    "PBHE 240 - Introduction to Applied Nutrition\n\nDescription: Primary roles of major nutrients in human body functions. Relationships between these nutrients and health outcomes/conditions including diabetes, cardiovascular diseases, cancer, osteoporosis and obesity.\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally\n\nAttribute(s): Experiences-Health",
    "PBHE 300 - Women's Health\n\nDescription: Explores health trends that affect women. Analysis of psychosocial influences on health with particular emphasis on the link between wealth and health. Same as WMST 300.\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently",
    "PBHE 305 - Foundations of Community and Public Health\n\nDescription: Introduces the history, philosophy, core disciplines of public health, including health education; describes the major public health threats and future directions of public health\n\nRestriction(s): Must be enrolled in one of the following Fields of Study (Major, Minor, or Concentration): Public Health\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall",
    "PBHE 353 - Public Health Data Analysis\n\nDescription: Basic concepts of biostatistics, descriptive and inferential statistics and their interpretation and application in resolving real-world public health issues, and hands-on practice of statistic software.\n\nPrerequisite(s): STAT 107 Minimum Grade of C OR STAT 244 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Majors: Health Education,Public Health\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall",
    "PBHE 363 - Public Health Policy and Management\n\nDescription: Review, analyze, and formulate a public health related policy. A model for an individual, community, and society to make informed consumer health related decisions.\n\nPrerequisite(s): HED 111 OR PBHE 111\n\nRestriction(s): Must be enrolled in one of the following Fields of Study (Major, Minor, or Concentration): Health Education,Public Health\n\nCredit Hours: 3\n\nNext available term: Fall 2024\n\nTerm frequency: Summer; Fall",
    "PBHE 370 - Public Health Communication\n\nDescription: Effective public health communication strategies for internal and external individuals, groups, and organizations to respond to health information, misinformation, and disinformation.\n\nPrerequisite(s): HED 305 Minimum Grade of C OR PBHE 305 Minimum Grade of C (concurrency allowed)\n\nRestriction(s): Must be enrolled in one of the following Fields of Study (Major, Minor, or Concentration): Health Education,Public Health\n\nCredit Hours: 3\n\nNext available term: Fall 2024\n\nTerm frequency: Spring; Fall",
    "PBHE 375 - Research Methods in Health\n\nDescription: General concepts and foundations of measurement, evaluation, and research; major methods and techniques of research and evaluation. Special emphasis given to conducting small research assignments.\n\nRestriction(s): Must be enrolled in one of the following Fields of Study (Major, Minor, or Concentration): Health Education,Public Health\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall",
    "PBHE 405 - Health Coaching\n\nDescription: Theories of health behavior and behavior change. Exploration of helping role as it relates to health behavior, health assessment analysis, decision making, problem solving, and referral skills.\n\nPrerequisite(s): HED 305 OR PBHE 305\n\nRestriction(s): Must be enrolled in one of the following Fields of Study (Major, Minor, or Concentration): Public Health\n\nCredit Hours: 3\n\nNext available term: Fall 2024\n\nTerm frequency: Spring; Fall",
    "PBHE 410 - Environment Health\n\nDescription: People's relationship with their environment; impact relationship has on status of one's health; and individual and community roles in promotion of environmental health. Not for graduate credit.\n\nPrerequisite(s): HED 111 OR PBHE 111 OR HED 201 OR PBHE 201\n\nRestriction(s): Must be enrolled in one of the following Majors: Health Education,Health Education,Public Health\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring",
    "PBHE 420 - Contemporary and Controversial Issues in Health\n\nDescription: Investigation of current controversial issues in health and health care. Emphasis on critical analysis and presentation of complex challenges from a public health perspective.\n\nPrerequisite(s): HED 305 OR PBHE 305\n\nRestriction(s): Must be enrolled in one of the following Fields of Study (Major, Minor, or Concentration): Health Education,Public Health\n\nCredit Hours: 3\n\nNext available term: Fall 2024\n\nTerm frequency: Spring",
    "PBHE 455 - Introduction to Epidemiology\n\nDescription: Epidemiologic terminologies. Description and analysis of disease occurrence using appropriate epidemiologic measurements. Exploration of causal relationships. Identification of epidemiologic roles in disease control and prevention.\n\nPrerequisite(s): PBHE 353 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Fields of Study (Major, Minor, or Concentration): Public Health\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall",
    "PBHE 462 - Special Topics in Public Health\n\nDescription: Relevant health issues. Topic and credit hours announced. May be repeated to a maximum of 6 hours so long as no topic is repeated.\n\nCredit Hours: 1 to 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Summer",
    "PBHE 489 - Independent Study in Public Health\n\nDescription: Independent projects or readings under the supervision of a public health faculty member.\n\nRegistration Consent: Instructor and Advisor\n\nCredit Hours: 1 to 6\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall",
    "PBHE 490 - Program Planning in Community Health\n\nDescription: Principles and approaches of planning programs within the community. Examination of program planning models. Application to various health education settings.\n\nPrerequisite(s): (HED 370 OR PBHE 370) AND (HED 375 OR PBHE 375) AND PBHE 305 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Fields of Study (Major, Minor, or Concentration): Health Education,Public HealthMust be enrolled in one of the following Classifications: Senior with Degree; Senior\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall",
    "PBHE 491 - Program Implementation and Evaluation in Community Health\n\nDescription: Principles and practices of health education program implementation and evaluation. Application of selected models and assessment strategies of community health education.\n\nPrerequisite(s): PBHE 490 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Fields of Study (Major, Minor, or Concentration): Health Education,Public HealthMust be enrolled in one of the following Classifications: Senior with Degree; Senior\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall",
    "PBHE 495 - Grant Writing in Public Health\n\nDescription: Practical application in the development of a grant for a public health agency or community. Strategies for exploring funding, collaboration, and preparation of quality proposals.\n\nPrerequisite(s): PBHE 490 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall",
    "PBHE 498 - Senior Professional Seminar\n\nDescription: Discussion of topics related to health education; ethics, professional responsibilities, preparation, and certification and future trends. Completion of portfolio and senior assignment required.\n\nPrerequisite(s): (HED 491 (concurrency allowed) OR PBHE 491 (concurrency allowed))\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring",
    "PBHE 499 - Internship in Public Health\n\nDescription: Supervised experiences in health agencies, clinics, government agencies and other professional settings. Not for graduate credit.\n\nPrerequisite(s): HED 498 (concurrency allowed) OR PBHE 498 (concurrency allowed)\n\nRestriction(s): Must be enrolled in one of the following Fields of Study (Major, Minor, or Concentration): Health Education,Public Health\n\nRegistration Consent: Instructor and Dept Chair\n\nCredit Hours: 6\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall",

    "ACS 304 - Conflict Management and Communication\n\nDescription: The study and practice of effective conflict management techniques including mediation, negotiation, and active listening strategies. Highlights the interdependence between communication, conflict, and professional growth.\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Info & Comm in Society",
    "ACS 311 - Intercultural Communication\n\nDescription: This course examines the processes, assumptions and barriers in intercultural encounters. Theories of cognition and communication will be explored.\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Social SciencesExperiences-Global CulturesExp-Global Culture Race EquityExp-US Race Gender & EquityExp-United States Cultures",
    "ACS 370 - Health Communication\n\nDescription: Examines the role of communication and culture in general models of health and illness, caregiver-patient relationships, social support, and health campaigns.\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Occasionally\n\nAttribute(s): Breadth-Social SciencesExp-Global Culture Race EquityExp-United States Cultures",

    "ANTH 352 - Medical Anthropology\n\nDescription: Theories and applications of medical anthropology. Cross-cultural perspectives on health and medicine.\n\nCredit Hours: 3\n\nNext available term: Fall 2024\n\nTerm frequency: Occasionally\n\nAttribute(s): Breadth-Social SciencesExperiences-Global CulturesExperiences-HealthExp-Global Culture Race EquityExp-US Race Gender & Equity",
    "ANTH 366 - Human Variation\n\nDescription: Examines differences between biological and social perspectives on human variation. Includes ethics, methods, and theory regarding variation in human genetics, sex, intelligence, health, and behavior.\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally\n\nAttribute(s): Breadth-Life Sciences",
    
    "CJ 311 - Perspectives on Terrorism\n\nDescription: A survey of international and domestic terrorism, the organizations, philosophies, and responses. Investigates the social, psychological, cultural, historical, political, religious, and economic dynamics of terrorism.\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring\n\nAttribute(s): Social Sciences",
    "CJ 420 - United States Drug Policy\n\nDescription: Examine historical and contemporary drug use and policy efforts, including secondary problems affiliated with drugs; and the war on drugs and its impact nationally and internationally.\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Fall\n\nAttribute(s): Exp-US Race Gender & EquitySocial Sciences",
    "CJ 464 - Mental Health and the Criminal Justice System\n\nDescription: Explores treatment of individuals with mental illness by police, courts, and corrections. Insanity defense, competency, commitment, diversion, and CIT discussed.\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally\n\nAttribute(s): Social Sciences",

    "GEOG 205 - Human Geography\n\nDescription: Geographic principles underlying the location and distribution of people and their activities in relation to the environment. IAI Course S4 900N.\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Social SciencesExperiences-Global CulturesExperiences-LaboratoryIAI GECC-Social Science",
    "GEOG 404 - Medical Geography\n\nDescription: This course examines medical geographic principles to understand the diversity of health around the world and the processes connecting them.\n\nPrerequisite(s): GEOG 205 Minimum Grade of C\n\nRestriction(s): May not be enrolled as the following Classifications: Freshman, 1st Semester; Freshman; Sophomore\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Occasionally\n\nAttribute(s): Social Sciences",
    "GEOG 418 - Geographic Information Systems (GIS)\n\nDescription: Concepts, basic theory, and principles of GIS using both Raster and Vector data models in a PC environment.\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall",
    "GEOG 454 - Topcs in Geographic Techniques\n\nDescription: Specific topics in geographic techniques based on faculty expertise. May be repeated to a maximum of 6 hours.\n\nRestriction(s): May not be enrolled as the following Classifications: Freshman, 1st Semester; Freshman; Junior; SophomoreMust be enrolled in one of the following Departments: Geography and GIS\n\nCredit Hours: 3\n\nNext available term: Fall 2024\n\nTerm frequency: Spring; Fall",

    "KIN 211 - Medical Terminology\n\nDescription: Learn to read and comprehend original research, medical reports, and health/fitness evaluations related to prefixes, suffixes, and word roots of medical terms.\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall",

    "MC 325 - Fundamentals of Advertising\n\nDescription: Provides an overview of advertising from the perspectives of marketing and social roles of advertising, consumer behavior, media, strategic research and planning, creative, and IMC.\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Humanities",
    "MC 452 - New Media and Technology\n\nDescription: Technological changes in the mass media. New media forms; audience fragmentation; and economic, regulatory, and social issues. Patters of adoption and diffusion.\n\nRestriction(s): Must be enrolled in one of the following Classifications: Senior with Degree; Senior\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Occasionally\n\nAttribute(s): Humanities",
    "MC 472 - Mass Media and Health\n\nDescription: Focuses on media literacy in the area of health, ethics related to media health content, the influence media have on health behavior and health policy.\n\nRestriction(s): Must be enrolled in one of the following Classifications: Graduate; Junior; Senior\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Summer\n\nAttribute(s): Breadth-Social SciencesExperiences-Health",

    "NURS 234 - Human Development Across the Lifespan\n\nDescription: Human growth and development and variations from conception to old age. Includes development of physiological, psychological, sociocultural, moral, ethical and spiritual systems. Non-majors can enroll with advisor permission.\n\nPrerequisite(s): PSYC 111\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall",
    "NUTR 250 - Introduction to Human Nutrition\n\nDescription: Fundamental principles of nutrition, including the role of specific nutrients, digestion, absorption, and metabolism. Application of concepts as they relate to humans across the lifespan will be discussed.\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Experiences-Health",
    "NUTR 375 - Community Nutrition\n\nDescription: Assessment, planning, and evaluation of community nutrition programs and policies using a systems approach.\n\nPrerequisite(s): NUTR 250 Minimum Grade of C\n\nRestriction(s): Must be enrolled in one of the following Fields of Study (Major, Minor, or Concentration): Nutrition\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally",
    "POLS 320 - Public Administration\n\nDescription: Processes and problems of managing government agencies, political context, policy impact, effects of bureaucratic organization; managing personnel and finances, evaluating effectiveness, controlling discretion.\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Spring\n\nAttribute(s): Breadth-Social Sciences",
    "POLS 370 - Introduction to International Relations\n\nDescription: Past and contemporary nation-state system; foreign policy behavior and processes, power, national interests, war, international law, organizations, economy, global problems and prospects. IAI Course S5 904.\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall\n\nAttribute(s): Breadth-Social SciencesExperiences-Global CulturesIAI GECC-Social Science",

    "PHIL 321 - Ethics in the Medical Community\n\nDescription: Ethical issues arising in health care contexts and practices.\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Humanities",
    "Psychology (PSYC)\nPSYC 111 - Foundations of Psychology\n\nDescription: History; psychological methods and techniques; biological foundations of behavior; learning; motivation; development; personality; social; and psychopathology. IAI Course S6 900.\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Social SciencesExperiences-HealthIAI GECC-Social Science",
    "PSYC 303 - Health Psychology\n\nDescription: This course provides an introduction to the field of health psychology, which is concerned with the roles of behavioral and psychosocial factors on health and disease.\n\nPrerequisite(s): PSYC 314 Minimum Grade of C OR BIOL 140 Minimum Grade of C OR (BIOL 240A Minimum Grade of C AND BIOL 240B Minimum Grade of C) AND PSYC 111 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall\n\nAttribute(s): Breadth-Social SciencesExperiences-Health",
    "PSYC 314 - Physiological Psychology\n\nDescription: Biological foundations of behavior; structure and function of brain related to personality, behavior, health.\n\nPrerequisite(s): PSYC 111\n\nCredit Hours: 3\n\nNext available term: Fall 2024\n\nTerm frequency: Summer; Fall\n\nAttribute(s): Breadth-Social Sciences",
    
    "SOC 309 - Social Class and Inequality\n\nDescription: Extent and causes of social inequality. Attention to consequences of the sustained existence of such inequalities in our everyday lives.\n\nCredit Hours: 3\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall\n\nAttribute(s): Breadth-Social SciencesExp-US Race Gender & EquityExp-United States Cultures",
    "SOC 310 - The Sociological Study of Sexualities and Society\n\nDescription: The sociological studies of sexualities with an emphasis on how sexualities are shaped by and operate within various institutions including medicine, economy, family, and education. Same as WMST 310.\n\nCredit Hours: 3\n\nNext available term: Fall 2024\n\nTerm frequency: Summer; Fall\n\nAttribute(s): Breadth-Social SciencesExperiences-HealthExp-US Race Gender & Equity",
    "SOC 383 - Medicine, Health, & Society\n\nDescription: Critically investigates contemporary medical and scientific research/policy, examines social stratification, and considers influences on structural health outcomes, with a focus on health inequalities.\n\nPrerequisite(s): Complete all Foundations Requirements: Foundation Writing 1, Foundation Writing 2, Foundation Speech Communication, Foundation Reasoning and Argumentation, and Foundation Quantitative Reasoning courses.\n\nCredit Hours: 3\n\nNext available term: Summer 2024\n\nTerm frequency: Spring\n\nAttribute(s): Breadth-Social SciencesExperiences-HealthInterdisciplinary Studies",

    "SOCW 386 - Health Care Issues in Social Work\n\nDescription: Examines contemporary health issues such as hypertension, diabetes, childhood obesity with emphasis on HIV/AIDS and how these diseases relate to populations at-risk.\n\nPrerequisite(s): BIOL 111\n\nRestriction(s): May not be enrolled as the following Classifications: Freshman, 1st Semester; Freshman; Sophomore\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently\n\nAttribute(s): Social Sciences",
    "SOCW 420 - Substance Abuse\n\nDescription: The course is designed to help students understand the etiology, course, and treatment of substance use disorders and other addictions. Special emphasis will be given to biological, psychological, and sociological theories of addiction. Addictions will be viewed within a “person-in-environment” context.\n\nPrerequisite(s): (ENG 101 Minimum Grade of C OR ENG 101N Minimum Grade of C) OR ENG 101E Minimum Grade of C AND (ENG 102 Minimum Grade of C OR ENG 102N Minimum Grade of C)\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally\n\nAttribute(s): Social Sciences",
    "SOCW 454 - Disability in Society\n\nDescription: Overview of issues and services pertaining to disability in American society including biological, psychological, familial and social considerations. Not for Graduate Credit.\n\nRestriction(s): May not be enrolled as the following Classifications: Freshman, 1st Semester; Freshman; Sophomore\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally\n\nAttribute(s): Social Sciences",
    "SOCW 491 - Mental Health\n\nDescription: Exploration of mental health issues. Specific attention to the use of the DSM, diagnosis of mental illnesses and values and ethics in social work practice. NOT FOR GRADUATE CREDIT. Advisor consent required.\n\nRestriction(s): May not be enrolled as the following Classifications: Freshman, 1st Semester; Freshman; Sophomore\n\nRegistration Consent: Advisor\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally\n\nAttribute(s): Social Sciences"
]