[
    "Academic Development (AD)\nAD 070 - Beginning Algebra\n\nDescription: Signed numbers, fractions, integer exponents, algebraic expressions, solving linear equations/inequalities, graphing, polynomial operations, factoring, rational expressions, systems of linear equations, applications. Credit not counted for graduation. Letter grades not counted in grade point average. Four contact hours. Upon completion of course, a grade of C or higher indicates readiness for enrollment in MATH 120E.\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Summer; Spring; Fall",
    "AD 080 - College Reading I\n\nDescription: This course, where reading is taught as an active process reliant on various techniques, broadens reading background and prepares students for success with academic coursework. Credit not counted for graduation. Letter grades not counted in grade point average. Five contact hours.\n\nCredit Hours: 5\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently",
    "AD 082 - College Reading II\n\nDescription: Course focuses on strengthening reading comprehension and critical reading skills. Credit not counted for graduation. Letter grades not counted in grade point average. Four contact hours.\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Spring; Fall",
    "AD 085 - Introduction to Geometry\n\nDescription: Fundamentals of Euclidean geometry: angles, parallel lines, polygons, circles, polyhedrons, area and volume, similarity, congruence, mathematical reasoning, informal proofs. Credit not counted towards graduation. Grades not calculated in GPA.\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Infrequently",
    "AD 090 - Basic Writing I\n\nDescription: Focus on thinking skills and expression of ideas within organized and coherent paragraphs and short essays. Emphasis on sentence skills and college level vocabulary. Credit not to be counted for graduation. Letter grades not counted in GPA. 5 contact hours.\n\nCredit Hours: 5\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Summer; Spring; Fall",
    "AD 092 - Basic Writing II\n\nDescription: Focus on writing of multi-paragraph essays and development of analytical skills needed to address abstract topics. Credit not to be counted for graduation. Letter grades not counted in grade point average. Four contact hours. Requires completion of stated prerequisite and/or consent of instructor.\n\nPrerequisite(s): Writing Skills Score 081 OR AD 090 Minimum Grade of C OR ACT English 19 OR ACCUPLACER Writing 243 OR WRIT/LANGUAGE TEST SCORE 26\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Fall",
    "AD 095 - Intermediate Algebra\n\nDescription: Polynomials, factoring, rational exponents, linear and quadratic equations/inequalities, functions, graphing, rational expressions, radicals, complex numbers, absolute value equations/inequalities, systems of equations, logarithms, geometry, applications. Credit not counted towards graduation. Grades not calculated in GPA. Five contact hours.\n\nPrerequisite(s): (AD 065 Minimum Grade of C OR AD 070 Minimum Grade of C) OR PLCMNTREC-Math 03 OR ACT Math 21 OR Algebra Score 046 OR AD 070 Minimum Grade of C\n\nCredit Hours: 3\n\nNext available term: Not Currently Scheduled\n\nTerm frequency: Occasionally",
    "AD 115 - Study Skills\n\nDescription: Improve study behaviors and attitudes through academic goal setting, study systems, note-taking techniques, test taking strategies, time management, classroom communication and problem solving.\n\nCredit Hours: 2\n\nNext available term: Spring 2024\n\nTerm frequency: Summer; Spring; Fall",
    "AD 116 - Reading Speed and Efficiency\n\nDescription: Improvement of reading rate and flexibility with emphasis on comprehension, vocabulary, and textbook reading strategies as related to reading efficiency and overall academic performance. Two contact hours.\n\nPrerequisite(s): AD 082 Minimum Grade of C OR ACT Reading 18 OR ACCUPLACER Reading 237 OR ENG 101 OR ENG 101N OR ENG 101E OR EVIDENCE-BASED READ/WRIT SCORE 490 OR READING TEST SCORE 24\n\nCredit Hours: 2\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall",
    "AD 117 - Career Planning & Development\n\nDescription: Career decision-making process investigates self awareness, career exploration, career information gathering, life styles and job search strategy, including development of resumes, interviewing skills and networking techniques.\n\nCredit Hours: 2\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall",
    "AD 120 - Developing Skills for College Success\n\nDescription: This course is intended to engage students by teaching effective strategies that increase performance and success in college and reinvigorate their interest in SIUE.\n\nRegistration Consent: Instructor and Advisor\n\nCredit Hours: 2\n\nNext available term: Spring 2024\n\nTerm frequency: Spring; Fall"
]